[{"Season":9,"Name":"S09E06 - Tomáš Krátký - Data Lineage v Manta a exit do IBM","Description":"Devátou sérii zakončujeme příběhem o tom, jak Tomáš Krátký a jeho tým založili startup Manta, který po letech růstu nakonec vzalo pod svá křídla IBM a posunula data lineage na novou úroveň. Máte-li v oblibě grafové databáze a dobré startupové konce, díl číslo 54 je ten pravý pro vás.","SpotifyHash":"3n9CohNaoYMRiMxp1L0Mzv"},{"Season":9,"Name":"S09E05 - Tomáš Sedláček - Dataddo","Description":"V předposledním díle deváté série jsme s otevřenou náručí přivítali CTO společnosti Dataddo Tomáše Sedláčka, který s námi koukl na střívka této datové služby ze všech možných úhlů. Pokud vás zajímá vše kolem jazyka Go, tak tohle bude díl přímo pro vás!","SpotifyHash":"1JTa7J7jbUVILJJzl5Dws9"},{"Season":9,"Name":"S09E04 - Milan Piskla - Vývoj ve světě IoT a Embedded","Description":"Za půlkou deváté série jsme to opět stočili k ryze hardcore IT tématu a to IoT a Embedded. Měli jsme tu čest přivítat našeho skvělého kolegu, hlavní mozek i srdce Embedded and IoT v Ciklum Western Europe a náš velký vzor Milana Pisklu, který nás tímto světem provedl a zahrnul nás, se skromností jemu vlastní, tunou zajímavých informací. Milan je super, dejte si!","SpotifyHash":"2FZRWA0fKCtrHZwHYSMs5T"},{"Season":9,"Name":"S09E03 - Libor Sionko - Z fotbalové reprezentace k Pythonu a Snowflake","Description":"Ve třetím díle deváté série vám přinášíme další unikátní příběh kariérního přestupu do IT a jméno dnešního hosta bude fanouškům fotbalu určitě povědomé. Libor Sionko - fotbalový reprezentant, několikanásobný vítěz ligy i poháru, vítěz rakouské i dánské ligy... a nově též ajťák. Jaké byly jeho začátky, jak se prolíná svět techniky a fotbalu, proč odešel z manažerského postu fotbalové reprezentace a co ho v IT nejvíce láká, to se dozvíte v dalším nadupaném díle #PodVocasem.","SpotifyHash":"42rPgUqr213Vw45Lxc2K2k"},{"Season":9,"Name":"S09E02 - Jakub Najberk - Implementace SAP v Automotive","Description":"Ani v deváté sérii nepolevujeme v prozkoumávání všech koutů IT a tentokrát jsme se mrkli na zoubek SAPu a především jeho implementaci v Automotive industry. K tomu jsme si pozvali Románkova starého známého z Mladé Boleslavi Jakuba Najberka alias Najbika, který nám vysvětlil nejen samotnou historii SAPu, ale především to, jak taková implementace probíhá a kde se vlastně berou všichni ti SAP konzultanti.","SpotifyHash":"0nk5rbsEMnN4Jo8YQRsMRV"},{"Season":9,"Name":"S09E01 - Vojta Tůma - Keboola","Description":"Keboola je už v českém startupovém prostředí pojem, ale je to stále ještě startup? A jak se změnila firemní kultura po prvním kole investic? A na čem vlastně celá Keboola běží? A proč jel Vojta na konec světa na motorce?! Samé otázky! Těch otázek bylo ještě víc a všechny nám je Vojta Tůma, toho času Field CTO Kebooly, zodpověděl. Dejte si parádní výkop deváté série.","SpotifyHash":"4iqK5tKFXUICVnSEvz2N90"},{"Season":8,"Name":"S08E06 - Dušan Vystrčil - LLMs a GenAI v DataSentics","Description":"Na závěr jsme si pozvali Dušana Vystrčila z DataSentics, který nám pověděl o své cestě z marketingu až k implementaci GenAI. Jak se taková implementace testuje, kolik toho chatbot udrží v kontextu a jak bude vypadat programátorská práce za 5 let? Dozvíte se na konci 8. série #PodVocasem!","SpotifyHash":"2FdUwyfvIq9KYPOsTy4Ekf"},{"Season":8,"Name":"S08E05 - Karel Matějka - Herní vývoj v Unity, pixelart a Bzzzt","Description":"Ani v osmé sérii nemůže chybět herní vývojářské okénko a ani tentorkát nemíříme nízko. Do studia dorazila legenda českého herního vývoje Karel Matějka, jehož pixelartová plošinovka Bzzzt dobyla herní svět a my jsme se tomu samozřejmě podívali na zoubek.","SpotifyHash":"4njLWeliaKoVrLZJTloEf8"},{"Season":8,"Name":"S08E04 - Honza Difko - Datový deepdive do České Spořitelny","Description":"Po delší době jsme opět zabrousili do datového světa a bylo nám velkou ctí přivítat obrovského sympaťáka a neskutečně nabušený \u0022datový mozek\u0022 Honzu Difka, který nám vysvětlil, jak Česká Spořitelna pracuje s daty, co plánují a jaké tooly jsou teď v kurzu. A neopomenul ani svoji životní vášeň pro cestování.","SpotifyHash":"3LzS8kSqOLcDzYAvBc4dn7"},{"Season":8,"Name":"S08E03 - Ivo Musil - IT Security v roce 2024","Description":"V třetím díle osmé série jsme si vzali konečně na paškál dlouho opomíjené téma bezpečnosti v IT. Do studia přijel CTO společnosti Corpus Solutions Ivo Musil, který nás do problematiky uvedl a nakonec jsme se dostali až k tomu, co by si IT mohlo vzít ze světa rugby. Další nabušená devadesátiminutovka je tu!","SpotifyHash":"1GHDXACsxoyyebsjCiTFFA"},{"Season":8,"Name":"S08E02 - Martin Děcký - Microkernel OS","Description":"Opět je tu deepdive, jak ho máte rádi a dneska to budou pro změnu mikrojádrové operační systémy. Do studia jsme nalákali Martina Děckého z firmy Kernkonzept, aby nám vysvětlil nejen úplné základy microkernel OS, ale taky řekl něco o svém letitém působení na Matfyzu, v Huawei a nebo třeba o tom, proč už 20 let spravuje open source operační systém HelenOS.","SpotifyHash":"5kjn3MFZtIwAZ8EVn8Zyol"},{"Season":8,"Name":"S08E01 - Ondřej Šika - DevOps","Description":"Ani v roce 2024 nebudete bez vašeho oblíbeného podcastu #PodVocasem, protože za námi do studia dorazil znalec DevOps, Kubernetes a jiných divočin Ondra Šika a jak je dobrý zvykem našeho podcastu, vzali jsme to komplet od podlahy. Je libo Kubernetes, Helm charts, IaaC, DevSecOps, nebo jakýkoliv jiný Ops? No tak si dejte první díl nové série!","SpotifyHash":"69L16LMtfJP2GyOht2KjbF"},{"Season":7,"Name":"S07 - Bloopers aneb co se nepovedlo","Description":"Bonusová vánoční epizoda je tady! Během těch 42 dílů se nám toho spoustu nepovedlo a náš kamarád (a autor skvělého zvukového obalu) Lukáš Jan Marek nelenil a udělal sestřih toho naprosto nejhoršího. Pozor! Pokud si to hodláte pustit k vykrajování perníčků, tak radši zažeňte děti pryč, protože je to velmi explicitní.  Jo a mrkněte na Lukášův Soundcloud, je tam kopa super muziky!  https://soundcloud.com/lukisjama  Tak šťastné a veselé a v roce 2024 u dalších sérií naslyšenou!","SpotifyHash":"2DBxRJWwUl14pVBIztHhTW"},{"Season":7,"Name":"S07E06 - Tomáš Grošup - Cesta z fintechu do compiler týmu v Microsoftu","Description":"Sedmou sérii a celkem 42. díl s námi #PodVocasem uzavřel člen F# compiler týmu z Microsoftu Tomáš Grošup, který nás provedl jeho zajímavou životní cestou. Co ho nebavilo ve fintechu, jak moc je Excel funkcionální a kolik unit testů mají v Microsoftu pro F# compiler? Dozvíte se během nabušených 80 minut!","SpotifyHash":"4zKMltowkuGfm5zYKAriQz"},{"Season":7,"Name":"S07E05 - Michal Sänger - BTC, Typescript a GraphQL v Trezor.io","Description":"Trvalo nám pouhopouhých 40 dílů, než jsme do agendy zařadili pokec o Bitcoinu a kryptoměnách obecně. A když už k nám Michal Sänger přišel, tak jsme kromě Trezor.io probrali i Typescript, GraphQL a jiné frontendové dobroty. Dejte si předposlední díl série!","SpotifyHash":"5Nu71tnsjJlr5IMVtOIlVi"},{"Season":7,"Name":"S07E04 - Michal Těhník - 8 let v Productboardu","Description":"Ve studiu #PodVocasem jsme měli tu čest přivítat 6. zaměstnance Productboardu a nadšence do Staff Engineeringu Michala \u0022MicTecha\u0022 Těhníka, se kterým jsme probrali jeho posledních 8 let v Productboardu. A nepokecali jsme jenom o tradičních tématech jako monolith vs microservices, architektura a změny ve firemních strukturách, ale dotkli jsme se i bolestivého tématu layoffs a jak je udělat správně.","SpotifyHash":"3pmc4dPHjbwOuYUQyZrLOM"},{"Season":7,"Name":"S07E03 - Tomáš Blaho - O Mafii, Warhorse Studios, programování grafiky v AAA titulech a pekle herních enginů","Description":"Znáte Mafii 1 a 2? A Forzu Horizon? A Kingdom Come? A Ori and the Blind Forest? Co kdybychom vám řekli, že k nám do studia dorazil někdo, kdo má prsty v programování herní grafiky pro tyhle AAA tituly? A kromě vzpomínání na dřevní doby vývoje vlastního LS3D enginu pro Mafii jsme se mrkli do střev nejznámějších herních titulů současnosti, včetně legendárního CRYENGINE.","SpotifyHash":"1OcQYEctVXh4UwXU9jwk8X"},{"Season":7,"Name":"S07E02 - Marcel Šerý - Cesta low-code startupu Jetveo","Description":"Až z dalekého Brna k nám dorazil CTO společnosti Jetveo Marcel Šerý a společně jsme probrali cestu jeho low-code startupu. Jaké chyby v týmu udělali, proč není dobrý nápad vytvářet abstrakci nad ASP.NET serverem a kterého programátorského hříchu lituje nejvíc? Dozvíte se v druhém díle sedmé série vašeho oblíbeného IT podcastu #PodVocasem.","SpotifyHash":"0HfvYAaR7bRWHH8Wjyf5Pk"},{"Season":7,"Name":"S07E01 - Antonín Kučera - Data v Livesport","Description":"Což takhle dát si sedmou sérii? Nu což, staniž se! A rozjedeme to hned ve velkým! Do studia totiž dorazil Head of BI ze společnosti Livesport Tonda Kučera a prozradil nám, s kolika daty pracují, jak ovlivňují výsledky utkání chování uživatelů a jak do toho celého zapadá mánie kolem generative AI.","SpotifyHash":"4zT72Y2Q9TzdTHtegV1j7f"},{"Season":6,"Name":"S06E06 - Jan Novotný - Java, jOpenSpace a EvitaDB","Description":"V závěrečném dílu šesté série nás #PodVocasem navštívil Honza Novotný z FG Forrest a vzali jsme to tradičně zleva zprava. Kromě očekávaných témat jako Javička jsme narazili i na Honzovu ne-konferenci jOpenSpace, Kafemlejnek.TV a nebo jeho poslední počin s magickým jménem EvitaDB. Pokud se zabýváte e-commerce, bude vás tenhle díl bavit dvojnásob!","SpotifyHash":"54dFouxZdumwuRiT2oTI7l"},{"Season":6,"Name":"S06E05 - Michal Hošna - Livestreaming v CDN77","Description":"O tom, co vlastně znamená přenést videobsah z jednoho koutu světa na druhý, kdy je latence opravdu problém a jak vyšplhat ze supportu do core týmu nám přišel povyprávět Head of Livestream Engineering ze společnosti CDN77 Michal Hošna. Máte-li rádi streaming, Rust, Cčko a punkový firmy, dnešní díl vám bude chutnat.","SpotifyHash":"625fWOXYc23jp3XKDxjDOi"},{"Season":6,"Name":"S06E04 - Tomáš Metz - Engineering v České Spořitelně","Description":"Pro někoho jsou banky symbolem zastaralosti a zkostňatění. To ovšem zdaleka neplatí pro Českou Spořitelnu, jejíž Head of Engineering Tomáš Metz nám popsal, jak se tvoří banka budoucnosti. Chcete-li vědět, jestli ve \u0022Spořce\u0022 vede React nebo Angular, zda-li zůstávají u Javy a jak Tomovi pomohly zkoušenosti z McKinsey \u0026 Company, už teď bušte do tlačítka play!","SpotifyHash":"3cMrwvtEDM4XEtXa2AzsTv"},{"Season":6,"Name":"S06E03 - Tomáš Muchka - Developer Experience v GoodData","Description":"Roman opět sáhl do svého bezedného měšce zajímavých ex-kolegů a vytáhl Principal UX Designera ve společnosti GoodData Tomáše Muchku, který nám povyprávěl o UX, DX, product discovery a jak to celé pasuje do sebe.","SpotifyHash":"5zmuQLAcwtglT8sPr9yyHf"},{"Season":6,"Name":"S06E02 - Filip Dvořák - Inteligentní automatizace s Filuta.ai","Description":"\u0022Softwarové inženýrství je hravá forma jak vyjádřit komplexní myšlenky.\u0022 Nejen toto prohlásil náš dnešní host Filip Dvořák ze společnosti Filuta.ai. Máte-li chuť na hoďku a čtvrt nabitou AI, symbolickými a jazykovými modely, automatizací a kdovíčím ještě, dejte si další díl podcastu #PodVocasem.","SpotifyHash":"5lyHiANgu4YtpTzjju83ry"},{"Season":6,"Name":"S06E01 - Michal Augustýn - Programátorský pokec o Avastu (a špetka hejtu na Scalu)","Description":"Šestou sérii vykopáváme ryze programátorským pokecem s Michalem \u0022Augi\u0022 Augustýnem, se kterým jsme probrali jeho dlouhou cestu Avastem, kariérní postup, microservices, conventional commits, monorepo... no prostě ten náš oblíbený mišmaš.","SpotifyHash":"2AewaQ0sC1qFtrWtOa4FBU"},{"Season":5,"Name":"S05E06 - Michal Halenka - Vaříme datový bujón v DataSentics","Description":"I v posledním díle páté série jsme si dali něco z Poliho ranku a pozvali si Michala Halenku - datového architekta firmy DataSentics. Michal se s námi podělil nejen o zkušenosti ze správy linuxových serverů na kolejích, ale vysvětlil i rozdíly mezi tím, jak vyvíjejí řešení tradiční programátoři a datoví vědci.","SpotifyHash":"7g07kgNX6SE61014fklugJ"},{"Season":5,"Name":"S05E05 - Petr Polák - Z výpočetního střediska Chemopetrolu do top managementu CGI","Description":"Tentokrát jsme si dovolili jednu velmi osobní finesku a pozvali si do studia dnes již bývalého viceprezidenta kanadské IT společnosti CGI Petra Poláka, který nám pověděl o své životní cestě a co si z ní odnesl. Pokud vám to jméno přijde povědomé, pak máte pravdu - je to skutečně Poliho otec. A že jablko nepadlo daleko od stromu, se můžete přesvědčit už teď.","SpotifyHash":"4cGgZdTJqJeAtGrXxCpJDe"},{"Season":5,"Name":"S05E04 - Tomáš Mikolov - Word2Vec, neuronové sítě a pravda o práci v Silicon Valley","Description":"Dnes nás navštívil jeden z nejcitovanějších vědců v oboru umělé inteligence, držitel ceny Neuron za excelenci ve vědě a autor přelomového algoritmu Word2Vec Tomáš Mikolov. Probrali jsme nejen jeho začátky s programováním vlastní verze Warcraftu, ale hlavně jeho neuvěřitelnou kariéru v Microsoft Research, Google a Facebooku.","SpotifyHash":"5GDn50l7Xl5sy7t2O4yt7u"},{"Season":5,"Name":"S05E03 - Radim Čebiš - Engineering ve Vendavu","Description":"Po delší době se opět vracíme do temných vod pricing softwaru a nevzali jsme si na pokec nikoho menšího než Engineering Directora firmy Vendavo Radima Čebiše, se kterým jsme to probrali tradičně zleva zprava. Jak se časem vyvíjí tech stack původně Java-based firmy a jak do toho zapadají akvizice ostatních firem? Vše se dozvíte v příjemné \u0022hoďce a čtvrt\u0022 strávené #PodVocasem.","SpotifyHash":"4AAO3QTdumRAdBt4BSCzf7"},{"Season":5,"Name":"S05E02 - Tomáš Petříček - Microsoft Research, Alan Turing Institute, design programovacích jazyků a F#","Description":"V druhém díle 5. série nás navštívila legenda funkcionálního .NETu Tomáš Petříček a kromě tradičních témat, jako je F#, jsme probrali i jeho cestu do Cambridge, Microsoft Research, Alan Turing Institute a nebo třeba to, zda-li by mimozemšťani pochopili Lambda Calculus.","SpotifyHash":"1crgcrl9dB2Z7pD1NxhCIR"},{"Season":5,"Name":"S05E01 - Martin Procházka - Performance .NET aplikací","Description":"Vykopáváme už 5. řadu podcastu #PodVocasem a tentokrát jsme si vzali na paškál platformu .NET a její výkon. Jakých chyb se vyvarovat, jak rychlost kódu měřit a může za všechno Entity Framework? Více se dozvíte pod tlačítkem \u0022Play\u0022","SpotifyHash":"1FYg8mGBFRBNjawLQIFKoL"},{"Season":4,"Name":"S04E06 - Aleš Lednej - Black Bison Tech a Salesforce","Description":"Čtvrtou sérii nám pomohl uzavřít CTO startupu Black Bison Tech Aleš Lednej, který s námi projel nejen datové dobroty, ale i specifika vývoje software na platformě Salesforce.","SpotifyHash":"6B2vafPmT8cCD2n9VZn9Tb"},{"Season":4,"Name":"S04E05 - Jirka Pénzeš - Startup Studio","Description":"Přišel, viděl, pokecal a navíc stanovil nový rekord v délce jednoho dílu podcastu na téměř devadesáti minutách. Jirka Pénzeš - technická hlava stojící za Startup Studiem s neskutečným přehledem. O čem je Startup Studio, co jsou PWAčka a jestli se vyplatí investovat do Flutteru?","SpotifyHash":"0Wnnqyj9IKtL59zWmBtvzj"},{"Season":4,"Name":"S04E04 - Ondřej Pelech - Scala","Description":"Scalu jsme měli v hledáčku už dlouho, ale až Ondra Pelech se nad námi slitoval a přišel nám tento prostor zaplnit zajímavým povídáním. Téměř hodina a půl deep dive do útrob Scaly je tu pro vás!","SpotifyHash":"1N9GOeGw4EeOfrrvr5gKZb"},{"Season":4,"Name":"S04E03 - Lukáš Rychtecký - Koncept svobodné firmy v Applifting","Description":"Svobodná firma - každý o tom mluví, ale málokdo to ve skutečnosti dělá. Jak to v takové svobodné firmě vypadá a je to jenom o otevřených platech, nebo je za tím ve skutečnosti víc? Nejen o tom jsme si povídali s Lukášem Rychteckým ze společnosti Applifting.","SpotifyHash":"1D8uX0eaSMtHpe1ISyrNGw"},{"Season":4,"Name":"S04E02 - David Pícha - Od boje s organizovaným zločinem k programování","Description":"Dneska jsme ve studiu #PodVocasem přivítali bývalého detektiva Národní centrály proti organizovanému zločinu (NCOZ), který se po 20 letech boje se zločinem rozhodl změnit kariéru a dal se na programování. Jak ho napadlo změnit obor a jaké jsou první krůčky? Dozvíte se v dalším dílu vaše oblíbeného podcastu.","SpotifyHash":"0BNZeLpsPreedjUlXbpDlX"},{"Season":4,"Name":"S04E01 - Dominik Moštěk - Funkcionální programování v Javě a role \u0022hostujícího profesora\u0022 v Ataccama","Description":"Už jsme chtěli odejít do zaslouženého podcastího důchodu, ale nakonec jsme se nechali překecat na ještě jednu sérii. A když teda novej díl, tak pořádně! Do studia jsme zlákali \u0022hostujícího profesora\u0022 Dominika Moštěka ze společnosti Ataccama, se kterým jsme hodili řeč o funkcionálním a objektovém programování, jak ho aplikovat v Javě, jak poznat code smell a o spoustě dalších zajímavých věcí. Dejte si!","SpotifyHash":"0YbeWQ1Gb6k723sz4H1Irt"},{"Season":3,"Name":"S03E06 - Cyril Sahula - Artificial Intelligence v recruitmentu, Azure Cloud a Kotlin v Jobno.one","Description":"Poslední díl třetí série uzavírá náš bývalý kolega a toho času CTO startupu Jobno.one Cyril Sahula, který k nám přijel popovídat o Azure Cloudu, aplikaci Artificial Intelligence v recrutimentu a nemohlo chybět ani malé shrnutí technologií a jazyků na JVM. Tento díl je tak dlouhý, že si ho můžete pouštět přes léto po částech, aby se vám nestýskalo.","SpotifyHash":"1TFOZDGLqFlraxBe4IGdGj"},{"Season":3,"Name":"S03E05 - Jakub Kašpar - UX, Dark Patterns a Design Sprint","Description":"Po ryze technických tématech jsme zabrousili do trošičku méně technických vod a společně s Kubou Kašparem jsme mrkli na zoubek UX, designu, design sprintu a spoustě dalších zajímavých věcí. Pokud máte v browseru neustále otevřenou Figmu a kečup vybíráte podle lahve, bude pro vás dnešní díl #PodVocasem rajskou hudbou.","SpotifyHash":"5miJakvkQ6qlAcfzI20wBs"},{"Season":3,"Name":"S03E04 - Jakub Veverka - Docker, Kubernetes a OpenShift","Description":"Čtvrtý díl podcastu #PodVocasem potěší především milovníky kontejnerů, Dockeru, Kubernetes a OpenShiftu. Navštívil nás starý známý Kuba Veverka z RedHatu a probrali jsme to pěkně od (dockerizované) podlahy. Pokud jste netušili, proč jsou kontejnery cool, tak teď už to určitě víte.  Disclaimer: Byť nosí Kuba firemní logo na tričku s patřičnou hrdostí, jeho názory byly ryze osobní.","SpotifyHash":"1OQjtC1KgwRXGWTPub9t8g"},{"Season":3,"Name":"S03E03 - Vojtěch Mádr - Xamarin a personalizovaná videa v Motionlab","Description":"Známá postava .NET komunity, milovník mobilního vývoje a znalec Xamarinu Vojta Mádr nás přišel navštívit a společně jsme si #PodVocasem povídali o jeho cestě z humanitní rodiny až do pozice CTO startupu Motionlab. Krom jiného jsme naťukli i věčný problém nedostatku žen v IT a nakonec jsme zabrousili i do nového Vojtova podcastu.","SpotifyHash":"30et8UEcl8r9ygbpxc5Ut1"},{"Season":3,"Name":"S03E02 - Radim Špetlík - Computer Vision a visionPigeon","Description":"Po delší době jsme se opět vrátili do divokých vod umělé inteligence a strojového učení a společně s CTO startupu visionPigeon Radimem Špetlíkem jsme probrali computer vision a jeho nepřeberné možnosti. Věděli jste, že se dá z barvy obličeje rozpoznat tep nebo relativní hladina cukru v krvi? A jak to souvisí s tím, co nabízí visionPigeon? Dozvíte se #PodVocasem.","SpotifyHash":"2nHqzbsi7M2myLAUcStaBD"},{"Season":3,"Name":"S03E01 - Milan Borůvka - Tech stack v PriceFx","Description":"Podcast #PodVocasem startuje třetí sérii a tentokrát se Džoukr a Poli podívali na zoubek technickému zázemí firmy PriceFx. Jak funguje engineering v budoucím unicornu, proč přepsat komponenty z Ember do Reactu a zbavíme se konečně Excelu? Nejen o tom se nám rozpovídal SVP of Engineering Milan Borůvka.","SpotifyHash":"6aY2rvKl3sYVIfqfK5S1gQ"},{"Season":2,"Name":"S02E06 - Honza Vrubel - Data Engineering v DHL","Description":"V závěrečném dílu druhé série nás navštívil datový mág Honza Vrubel, aby nám představil, jak se v DHL zachází s daty a jaká cesta vede od hrubých dat až po voňavé reporty v prezentacích managementu. Pokud vám něco říká ETL, Oracle Data Integrator, Teradata, Tabular nebo třeba PowerBI, bude tohle díl přímo pro vás.","SpotifyHash":"2wF7eTc3nsEeww0Wnm58eX"},{"Season":2,"Name":"S02E05 - Aleš Roubíček - Clojure","Description":"Enfant terrible českého Twitteru, milovník Clojure, funkcionálního programování, přímočarosti a čistoty kódu. Pro Aleše Roubíčka alias Rarouše bychom našli možná stovky dalších důvodů, proč si ho pozvat do studia #PodVocasem, ale dneska jsme naťukli především jazyk Clojure. Jak je u Aleše dobrý zvykem, došlo na řadu silných názorů, výborných myšlenek a pár explicitních výrazů. Dejte si - za tu hoďku to stojí!","SpotifyHash":"1qBNACavMXSflvUv27IhX0"},{"Season":2,"Name":"S02E04 - Luboš Hradecký - Web Accessibility","Description":"Po delší době jsme opět sáhli do vnitropodnikového šuplíku hostů a vytáhli našeho milého kolegu a znalce webové přístupnosti Luboše Hradeckého. Jak udělat váš web, aby byl přístupný i pro návštěvníky se zdravotním omezením a který web to dělá vyloženě blbě? Nejen to se dozvíte v dalším díle podcastu #PodVocasem.","SpotifyHash":"4XsTAkt6iI0AjyJrprgZ7q"},{"Season":2,"Name":"S02E03 - Zdeněk Merta - Event Sourcing, CQRS a Domain Driven Design","Description":"Už delší dobu jsme měli v TODO listu téma Event Sourcingu, CQRS a DDD a konečně se nám podařilo si pozvat odborníka s praktickými zkušenostmi ze stavění bankovních systémů. Co je Event Sourcing, proč ho dělat a kdy ho naopak nedělat? Co je task-based UI a není nakonec lepší starej dobrej CRUD? Dozvíte se v neskutečně nabušených 70 minutách dalšího dílu podcastu #PodVocasem.  Odkazy: https://www.eventstore.com http://www.cs.cornell.edu/andru/cs711/2002fa/reading/sagas.pdf https://en.wikipedia.org/wiki/Enterprise_Integration_Patterns","SpotifyHash":"3F48ssf0hp8xeTDcQikWCq"},{"Season":2,"Name":"S02E02 - Borek Bernard - Monorepo, Multirepo, VersionPress a Shoptet","Description":"Po eskapádách na elektrokole k nám do studia konečně dorazil i znalec frontendových technologií a git mág Borek Bernard, abychom to probrali tak nějak z gruntu a omrkli jeho práci na VersionPressu, Shoptetu, ale i další zajímavá témata jako třeba nekonečnou bitvu mezi monorepem a multirepem.","SpotifyHash":"3KnoUbTLmcPp4fbd6LTMPi"},{"Season":2,"Name":"S02E01 - Aleš Krutina - Jablotron, senzory a hardware obecně","Description":"Druhou sérii jsme se rozhodli vykopnout pěkně z vostra a tak jsme si pozvali bývalého CTIO z Jablotronu a člověka s neskutečným rozhledem nejen ve světě hardware Aleše Krutinu. Jak probíhají inovace v Jablotronu, co vlastně aktivuje senzor na tříštění skla a kdy se svět čipů otevře širší komunitě programátorů? To tlačítko, které hledáte, je PŘEHRÁT...","SpotifyHash":"6MrC5yDRoleofSBfLP1pmd"},{"Season":1,"Name":"S01E06 - Lukáš Svoboda - CSS v roce 2022","Description":"S novým rokem uzavíráme první sérii #PodVocasem a uzavíráme ji stylově. Doslova! Do studia dorazil odborník na CSS a lektor Czechitas Lukáš Svoboda a společně jsme probrali stav webu a jeho stylování na začátku roku 2022.","SpotifyHash":"04UtuIzyr6SW6zU0zekPbV"}]